my_string=(input("Представтесь пожалуйста: "))
     #Присвоили переменной my_strng производный текст с помощью команды input()
print("Привет: " +my_string.upper())
     #c помощью команды .upper после переменной , любой ввод текста в строке выводится большими буквами.
print("Привет: " +my_string.lower())
     #c помощью команды .lower после переменной , любой ввод текста в строке выводится маленькими буквами.
my_string=(input("Каквашенастроение?: "))
     #Присвоили переменной my_string слитный текст, и на строке отображается без пробелов.
print(my_string[0])
     #Вывели на экран только первый символ текста
print(my_string[-1])
     #Вывели на экран только последний символ текста